In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# reading two csv files
data1 = pd.read_csv('/content/AWCustomers.csv')
data2 = pd.read_csv('/content/AWSales.csv')

# using merge function by setting how='inner'
output1 = pd.merge(data1, data2,
				on='CustomerID',
				how='inner')

# displaying result
print(output1)

output1.to_csv('output1.csv', index=False)

       CustomerID Title FirstName MiddleName  LastName Suffix  \
0           21173   NaN      Chad          C      Yuan    NaN
1           13249   NaN      Ryan        NaN     Perry    NaN
2           29350   NaN     Julia        NaN  Thompson    NaN
3           13503   NaN  Theodore        NaN     Gomez    NaN
4           22803   NaN  Marshall          J      Shan    NaN
...           ...   ...       ...        ...       ...    ...
18356       25414   NaN     Grace          C    Bailey    NaN
18357       11459   NaN     Tasha        NaN      Deng    NaN
18358       12160   NaN    Jaclyn        NaN     Zhang    NaN
18359       14353   NaN      Erin          I      Reed    NaN
18360       16676   NaN    Amanda        NaN     Perry    NaN

                 AddressLine1 AddressLine2            City  \
0          7090 C. Mount Hood          NaN      Wollongong
1         3651 Willow Lake Rd          NaN         Shawnee
2      1774 Tice Valley Blvd.          NaN     West Covina
3             2103 Baldwin Dr          NaN       Liverpool
4             Am Gallberg 234          NaN           Werne
...                       ...          ...             ...
18356      6627 Camelback Ct.          NaN        Coronado
18357         9627 Kendall Rd          NaN  Port Macquarie
18358       4364 Viera Avenue          NaN       Beaverton
18359  3866 Mt. Everest Court          NaN       Vancouver
18360     7870 Orangewood Dr.          NaN       Grossmont

         StateProvinceName  ... Gender MaritalStatus HomeOwnerFlag  \
0          New South Wales  ...      M             M             1
1         British Columbia  ...      M             M             1
2               California  ...      F             S             0
3                  England  ...      M             M             1
4      Nordrhein-Westfalen  ...      M             S             1
...                    ...  ...    ...           ...           ...
18356           California  ...      F             M             0
18357      New South Wales  ...      F             S             0
18358               Oregon  ...      F             S             0
18359     British Columbia  ...      F             S             0
18360           California  ...      F             M             1

      NumberCarsOwned NumberChildrenAtHome TotalChildren YearlyIncome  \
0                   3                    0             1        81916
1                   2                    1             2        81076
2                   3                    0             0        86387
3                   2                    1             2        61481
4                   1                    0             0        51804
...               ...                  ...           ...          ...
18356               1                    0             2        52953
18357               2                    0             0        60992
18358               2                    0             0        51859
18359               0                    0             0        87177
18360               2                    0             0       136856

      LastUpdated  BikeBuyer  AvgMonthSpend
0      2017-03-06          1          50.97
1      2017-03-06          1          53.11
2      2017-03-06          1          54.08
3      2017-03-06          1          56.93
4      2017-03-06          1          55.41
...           ...        ...            ...
18356  2017-03-06          0          48.14
18357  2017-03-06          1          50.23
18358  2017-03-06          1          49.56
18359  2017-03-06          0          51.42
18360  2017-03-06          1          52.27

[18361 rows x 26 columns]

In [ ]:
df = pd.read_csv('output1.csv')
df.head()

,CustomerID,Title,FirstName,MiddleName,LastName,Suffix,AddressLine1,AddressLine2,City,StateProvinceName,...,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,NumberChildrenAtHome,TotalChildren,YearlyIncome,LastUpdated,BikeBuyer,AvgMonthSpend
0,21173,NaN,Chad,C,Yuan,NaN,7090 C. Mount Hood,NaN,Wollongong,New South Wales,...,M,M,1,3,0,1,81916,2017-03-06,1,50.97
1,13249,NaN,Ryan,NaN,Perry,NaN,3651 Willow Lake Rd,NaN,Shawnee,British Columbia,...,M,M,1,2,1,2,81076,2017-03-06,1,53.11
2,29350,NaN,Julia,NaN,Thompson,NaN,1774 Tice Valley Blvd.,NaN,West Covina,California,...,F,S,0,3,0,0,86387,2017-03-06,1,54.08
3,13503,NaN,Theodore,NaN,Gomez,NaN,2103 Baldwin Dr,NaN,Liverpool,England,...,M,M,1,2,1,2,61481,2017-03-06,1,56.93
4,22803,NaN,Marshall,J,Shan,NaN,Am Gallberg 234,NaN,Werne,Nordrhein-Westfalen,...,M,S,1,1,0,0,51804,2017-03-06,1,55.41

In [ ]:
to_drop = ['Title',
           'FirstName',
           'LastName',
           'AddressLine1',
           'City',
           'StateProvinceName',
           'PostalCode',
           'PhoneNumber',
          'MiddleName',
          'Suffix',
          'AddressLine2',
          'BirthDate',
          'NumberChildrenAtHome',
          'TotalChildren',
          'Education']

df.drop(to_drop, inplace=True, axis=1)

In [ ]:
df.head()

,CustomerID,CountryRegionName,Occupation,Gender,MaritalStatus,HomeOwnerFlag,NumberCarsOwned,YearlyIncome,LastUpdated,BikeBuyer,AvgMonthSpend
0,21173,Australia,Clerical,M,M,1,3,81916,2017-03-06,1,50.97
1,13249,Canada,Clerical,M,M,1,2,81076,2017-03-06,1,53.11
2,29350,United States,Clerical,F,S,0,3,86387,2017-03-06,1,54.08
3,13503,United Kingdom,Skilled Manual,M,M,1,2,61481,2017-03-06,1,56.93
4,22803,Germany,Skilled Manual,M,S,1,1,51804,2017-03-06,1,55.41

In [ ]:
from sklearn import preprocessing
le=preprocessing.LabelEncoder()
df['Occupation']=le.fit_transform(df['Occupation'])
df['Occupation'].unique()

array([0, 4, 2, 1, 3])

In [ ]:
from sklearn import preprocessing
le=preprocessing.LabelEncoder()
df['CountryRegionName']=le.fit_transform(df['CountryRegionName'])
df['CountryRegionName'].unique()

array([0, 1, 5, 4, 3, 2])

In [ ]:
from sklearn import preprocessing
enc=preprocessing.OneHotEncoder()
enc.fit([['Gender']])
df['Gender'].unique()

array(['M', 'F'], dtype=object)

In [ ]:
from scipy.stats import pearsonr

In [ ]:
from scipy.spatial import distance

In [ ]:
distance.cosine(df['Occupation'].values,df['YearlyIncome'].values)

0.33805584529203747

In [ ]:
distance.jaccard(df['Occupation'].values,df['YearlyIncome'].values)

1.0

In [ ]:
pearsonr(df['Occupation'].values,df['YearlyIncome'].values)

(-0.31413606176937525, 0.0)

In [ ]:
corr=df["Occupation"].corr(df['YearlyIncome'])

In [ ]:
print(round(corr,3))

-0.314